# Rebar Crank Type Utils Create Rebar Crank Type Method

Source: https://www.revitapidocs.com/2026/a1bbebb5-4b7d-75ea-ff6d-effd80f3f681.htm

---

| Rebar Crank Type Utils Create Rebar Crank Type Method |
| --- |

Creates a Rebar Crank Type element.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ElementType CreateRebarCrankType(
	Document document,
	string typeName
)
```

```
Public Shared Function CreateRebarCrankType (
	document As Document,
	typeName As String
) As ElementType
```

```
public:
static ElementType^ CreateRebarCrankType(
	Document^ document,
	String^ typeName
)
```

```
static member CreateRebarCrankType :
        document : Document *
        typeName : string -> ElementType
```

#### Parameters

document Document
:   The document.

typeName String
:   The Rebar Crank Type name.

#### Return Value

ElementType
The Rebar Crank Type. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The given value for typeName cannot be an empty string.  \-or\-  The given value for typeName cannot include prohibited characters.  \-or\-  The given value for typeName is already in use by another Rebar Crank Type. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

RebarCrankTypeUtils Class Autodesk.Revit.DB.Structure Namespace